{
    "<unk>": 0,
    "<pad>": 1,
    "<start>": 2,
    "<end>": 3,
    "nan": 4,
    "create": 5,
    "string": 6,
    "s": 7,
    "integers": 8,
    "x1": 9,
    ",": 10,
    "y1": 11,
    "x2": 12,
    "y2": 13,
    "read": 14,
    "set": 15,
    "to": 16,
    "[": 17,
    "0": 18,
    "]": 19,
    "-": 20,
    "96": 21,
    "1": 22,
    "'": 23,
    "print": 24,
    "maximum": 25,
    "of": 26,
    "absolute": 27,
    "value": 28,
    "and": 29,
    "newline": 30,
    "while": 31,
    "is": 32,
    "not": 33,
    "or": 34,
    "if": 35,
    "greater": 36,
    "than": 37,
    "``": 38,
    "R": 39,
    "''": 40,
    "increment": 41,
    "less": 42,
    "L": 43,
    "decrement": 44,
    "D": 45,
    "U": 46,
    "\\n": 47,
    "=": 48,
    "Read": 49,
    "(": 50,
    ")": 51,
    "!": 52,
    "OR": 53,
    "TRUE": 54,
    "do": 55,
    "the": 56,
    "following": 57,
    "a": 58,
    "new": 59,
    "line": 60,
    "character": 61,
    "array": 62,
    "c1": 63,
    "size": 64,
    "2": 65,
    "c2": 66,
    "vector": 67,
    "ans": 68,
    "add": 69,
    "element": 70,
    "RU": 71,
    "end": 72,
    "else": 73,
    "RD": 74,
    "LD": 75,
    "LU": 76,
    "for": 77,
    "i": 78,
    "exclusive": 79,
    "let": 80,
    "be": 81,
    "an": 82,
    "characters": 83,
    "length": 84,
    "strings": 85,
    "||": 86,
    "<": 87,
    "&": 88,
    "push": 89,
    "into": 90,
    "increase": 91,
    "by": 92,
    "one": 93,
    ">": 94,
    "decrease": 95,
    "all": 96,
    "elements": 97,
    "with": 98,
    "after": 99,
    "each": 100,
    "n": 101,
    "m": 102,
    "long": 103,
    "x": 104,
    "y": 105,
    "b": 106,
    "s1": 107,
    "int": 108,
    "-n": 109,
    "-m": 110,
    "bitwise": 111,
    "invert": 112,
    "sign": 113,
    "'D": 114,
    "max": 115,
    "now": 116,
    "goal": 117,
    "way": 118,
    "100": 119,
    "step": 120,
    "tstep": 121,
    "-step": 122,
    ".": 123,
    "equal": 124,
    "'RD": 125,
    "'LD": 126,
    "'RU": 127,
    "'LU": 128,
    "S": 129,
    "49": 130,
    "97": 131,
    "Way": 132,
    "integer": 133,
    "counter": 134,
    "true": 135,
    "sign_X": 136,
    "/": 137,
    "sigh_Y": 138,
    "sign_Y": 139,
    "-1": 140,
    "break": 141,
    "loop": 142,
    "'\\n": 143,
    "empty": 144,
    "WAY": 145,
    "abs": 146,
    "otherwise": 147,
    "append": 148,
    "are": 149,
    "both": 150,
    "10": 151,
    "2d": 152,
    "csx": 153,
    "ctx": 154,
    "sx": 155,
    "sy": 156,
    "tx": 157,
    "ty": 158,
    "k": 159,
    "6": 160,
    "8": 161,
    "3": 162,
    "5": 163,
    "k-th": 164,
    "4": 165,
    "7": 166,
    "inclusive": 167,
    "declare": 168,
    "res": 169,
    "as": 170,
    "arguments": 171,
    "returning": 172,
    "return": 173,
    "from": 174,
    "function": 175,
    "xy": 176,
    "wtih": 177,
    "j": 178,
    "l": 179,
    "count": 180,
    "vec": 181,
    "result": 182,
    "run": 183,
    "that": 184,
    "returns": 185,
    "char": 186,
    "assign": 187,
    "called": 188,
    "aa": 189,
    "bb": 190,
    "values": 191,
    "creat": 192,
    "t": 193,
    "+": 194,
    "+1": 195,
    "define": 196,
    "symbol": 197,
    "d": 198,
    "short": 199,
    "ints": 200,
    "d1": 201,
    "d2": 202,
    "min": 203,
    "minimum": 204,
    "casted": 205,
    "variable": 206,
    "inp": 207,
    ";": 208,
    "64": 209,
    "c": 210,
    "at": 211,
    "index": 212,
    "r": 213,
    "ctr": 214,
    "dr": 215,
    "dc": 216,
    "vectors": 217,
    "VI": 218,
    "VI2": 219,
    "VI3": 220,
    "VI4": 221,
    "f": 222,
    "RU\\n": 223,
    "RD\\n": 224,
    "LU\\n": 225,
    "LD\\n": 226,
    "U\\n": 227,
    "D\\n": 228,
    "R\\n": 229,
    "L\\n": 230,
    "arrays": 231,
    "xx": 232,
    "yy": 233,
    "y1-y2": 234,
    "start": 235,
    "endless": 236,
    "s2": 237,
    "c_x": 238,
    "c_y": 239,
    "d_y": 240,
    "d_x": 241,
    "-y": 242,
    "get": 243,
    "open": 244,
    "file": 245,
    "cp.inp": 246,
    "reading": 247,
    "cp.out": 248,
    "writing": 249,
    "CP.inp": 250,
    "mode": 251,
    "using": 252,
    "stream": 253,
    "stdin": 254,
    "CP.out": 255,
    "w": 256,
    "stdout": 257,
    "reference": 258,
    "in": 259,
    "t1": 260,
    "t2": 261,
    "q": 262,
    "v": 263,
    "z": 264,
    "u": 265,
    "G": 266,
    "minimal": 267,
    "sum": 268,
    "times": 269,
    "current": 270,
    "destination": 271,
    "input": 272,
    "udmoves": 273,
    "rlmoves": 274,
    "aboslute": 275,
    "o": 276,
    "p": 277,
    "multiply": 278,
    "longs": 279,
    "*": 280,
    "n1": 281,
    "n2": 282,
    "startx": 283,
    "starty": 284,
    "endx": 285,
    "endy": 286,
    "starx": 287,
    "variables": 288,
    "type": 289,
    "i-th": 290,
    "d=": 291,
    "k=": 292,
    "dest": 293,
    "letter_start": 294,
    "letter_start=start": 295,
    "letter_dest": 296,
    "num_start": 297,
    "num_dest": 298,
    "v1": 299,
    "v2": 300,
    "v1+v2-minimum": 301,
    "i1": 302,
    "i2": 303,
    "l1": 304,
    "l2": 305,
    "str": 306,
    "1000": 307,
    "y1=": 308,
    "subtract": 309,
    "cx": 310,
    "cy": 311,
    "dx": 312,
    "dy": 313,
    "48": 314,
    "xd": 315,
    "yd": 316,
    "decrementing": 317,
    "can": 318,
    "mx": 319,
    "-s2": 320,
    "rx": 321,
    "ry": 322,
    "xf": 323,
    "yf": 324,
    "kol": 325,
    "==": 326,
    "{": 327,
    "}": 328,
    "xie": 329,
    "r1": 330,
    "r2": 331,
    "=integers": 332,
    "=string": 333,
    "1001": 334,
    "cnt": 335,
    "content": 336,
    "indices": 337,
    "through": 338,
    "xs": 339,
    "ys": 340,
    "xt": 341,
    "yt": 342,
    "200": 343,
    "yet": 344,
    "yes": 345,
    "p1": 346,
    "p2": 347,
    "chars": 348,
    "pointers": 349,
    "lesser": 350,
    "--": 351,
    "inline": 352,
    "no": 353,
    "ch": 354,
    "digit": 355,
    "'-": 356,
    "bitshift": 357,
    "left": 358,
    "fx": 359,
    "fy": 360,
    "incremented": 361,
    "whitespace": 362,
    "getchar": 363,
    "inccrement": 364,
    "gap": 365,
    "terminated": 366,
    "discard": 367,
    "hi2": 368,
    "then": 369,
    "ex": 370,
    "ey": 371,
    "flag1": 372,
    "flag2": 373,
    "fabs": 374,
    "ex-sx": 375,
    "ey-sy": 376,
    "argument": 377,
    "on": 378,
    "every": 379,
    "iteration": 380,
    "diag": 381,
    "diag2": 382,
    "i1-l1": 383,
    "getint": 384,
    "9": 385,
    "-a": 386,
    "excluisve": 387,
    "absoluve": 388,
    "integet": 389,
    "truthy": 390,
    "more": 391,
    "reduce": 392,
    "lessen": 393,
    "fastIo": 394,
    "invoke": 395,
    "MAT": 396,
    "LC": 397,
    "RC": 398,
    "TR": 399,
    "BR": 400,
    "boolean": 401,
    "first": 402,
    "false": 403,
    "min_i": 404,
    "min_j": 405,
    "max_i": 406,
    "max_j": 407,
    "51": 408,
    "55": 409,
    "check": 410,
    "mn": 411,
    "888888": 412,
    "m1": 413,
    "m2": 414,
    "444": 415,
    "ar": 416,
    "uper": 417,
    "lowar": 418,
    "right": 419,
    "ck": 420,
    "con": 421,
    "h1": 422,
    "stop": 423,
    "h2": 424,
    "until": 425,
    "2e9": 426,
    "66": 427,
    "6666": 428,
    "finishx": 429,
    "finishy": 430,
    "startx=55": 431,
    "starty=55": 432,
    "st": 433,
    "90": 434,
    "hangx": 435,
    "4409": 436,
    "coty": 437,
    "4999": 438,
    "tt": 439,
    "xaydung": 440,
    "hang": 441,
    "cot": 442,
    "void": 443,
    "bao1": 444,
    "bao2": 445,
    "demx": 446,
    "demy": 447,
    "maxx": 448,
    "col": 449,
    "tt-1": 450,
    "sort": 451,
    "chodoi": 452,
    "call": 453,
    "-100": 454,
    "A": 455,
    "xmin": 456,
    "xmax": 457,
    "ymin": 458,
    "ymax": 459,
    "mat": 460,
    "e": 461,
    "counting": 462,
    "down": 463,
    "50": 464,
    "substring": 465,
    "arr": 466,
    "up": 467,
    "mni": 468,
    "mnj": 469,
    "mxi": 470,
    "mxj": 471,
    "INT_MAX": 472,
    "miny": 473,
    "maxy": 474,
    "minx": 475,
    "ch1": 476,
    "ch2": 477,
    "ch3": 478,
    "ch4": 479,
    "x0": 480,
    "y0": 481,
    "go": 482,
    "jump": 483,
    "point": 484,
    "=n": 485,
    "label": 486,
    "lx": 487,
    "ly": 488,
    "constant": 489,
    "MOD": 490,
    "1000000007": 491,
    "INF": 492,
    "INF2": 493,
    "1000000007LL": 494,
    "double": 495,
    "EPS": 496,
    "1e-9": 497,
    "minj": 498,
    "maxi": 499,
    "maxj": 500,
    "-INF": 501,
    "mini": 502,
    "a1": 503,
    "a2": 504,
    "a3": 505,
    "a4": 506,
    "lett": 507,
    "errl": 508,
    "err": 509,
    "alt": 510,
    "ust": 511,
    "sag": 512,
    "sol": 513,
    "-1000": 514,
    "incluisive": 515,
    "60": 516,
    "500": 517,
    "endj": 518,
    "incrementing": 519,
    "endi": 520,
    "99999999": 521,
    "101": 522,
    "lu": 523,
    "ru": 524,
    "ld": 525,
    "rd": 526,
    "100000": 527,
    "hi": 528,
    "hj": 529,
    "li": 530,
    "lj": 531,
    "flag": 532,
    "gg": 533,
    "0x3f": 534,
    "m3": 535,
    "m4": 536,
    "map": 537,
    "booleans": 538,
    "g": 539,
    "52": 540,
    "X": 541,
    "Y": 542,
    "999999": 543,
    "ok": 544,
    "999": 545,
    "mini1": 546,
    "mini2": 547,
    "maxi1": 548,
    "maxi2": 549,
    "imx": 550,
    "imn": 551,
    "jmx": 552,
    "jmn": 553,
    "1222": 554,
    "-2019": 555,
    "MX": 556,
    "1e4": 557,
    "continue": 558,
    "arr1": 559,
    "imin": 560,
    "imax": 561,
    "jmin": 562,
    "jmax": 563,
    "imex": 564,
    "row_min": 565,
    "row_max": 566,
    "11": 567,
    "fill": 568,
    "%": 569,
    "i=": 570,
    "34298343": 571,
    "2193809": 572,
    "data": 573,
    "initialized": 574,
    "craete": 575,
    "row": 576,
    "graph": 577,
    "start_x": 578,
    "start_y": 579,
    "end_x": 580,
    "end_y": 581,
    "Min_X": 582,
    "Min_Y": 583,
    "Max_X": 584,
    "Max_Y": 585,
    "sheet": 586,
    "minRow": 587,
    "minCol": 588,
    "maxRow": 589,
    "maxCol": 590,
    "pointer": 591,
    "shap": 592,
    "newchar": 593,
    "rows": 594,
    "colums": 595,
    "rowe": 596,
    "colume": 597,
    "user": 598,
    "change": 599,
    "name": 600,
    "standard": 601,
    "output": 602,
    "N": 603,
    "123": 604,
    "1e9": 605,
    "KIOT_camp": 606,
    "x3": 607,
    "y3": 608,
    "x4": 609,
    "y4": 610,
    "exit": 611,
    "m=int": 612,
    "s=vector": 613,
    "checktop": 614,
    "args": 615,
    "i=0": 616,
    "j=0": 617,
    "checkbottom": 618,
    "i=n-1": 619,
    "checkleft": 620,
    "checkright": 621,
    "i=m-1": 622,
    "resize": 623,
    "left=checkleft": 624,
    "right=checkright": 625,
    "top=checktop": 626,
    "bottom=checkbottom": 627,
    "i=top": 628,
    "bottom": 629,
    "starting": 630,
    "len": 631,
    "right-left+1": 632,
    "n-1": 633,
    "m-1": 634,
    "flag=0": 635,
    "i=u": 636,
    "j=l": 637,
    "#": 638,
    "modulo": 639,
    "odd": 640,
    "where": 641,
    "'\\0": 642,
    "bitwise-and": 643,
    "multiple": 644,
    "even": 645,
    ".\\n": 646,
    "const": 647,
    "maxn": 648,
    "200000": 649,
    "zw": 650,
    "make": 651,
    "pair": 652,
    "30": 653,
    "ss": 654,
    "sss": 655,
    "falsy": 656,
    "temp": 657,
    "uneven": 658,
    "=1": 659,
    "adding": 660,
    "further": 661,
    "1e5": 662,
    "nn": 663,
    "305": 664,
    "method": 665,
    "different": 666,
    "flg": 667,
    "=0": 668,
    "lie": 669,
    "skip": 670,
    "rest": 671,
    "filled": 672,
    "changing": 673,
    "increasing": 674,
    "setting": 675,
    "printing": 676,
    "rem": 677,
    "v3": 678,
    "make_pair": 679,
    "se": 680,
    "h": 681,
    "mod": 682,
    "pritn": 683,
    "n't": 684,
    "reset": 685,
    "i=1": 686,
    "m=": 687,
    "i=i+2": 688,
    "exclusivem": 689,
    "i+1": 690,
    "endline": 691,
    "fastio": 692,
    "m=long": 693,
    "120": 694,
    "2000010": 695,
    "taking": 696,
    "mul": 697,
    "1LL": 698,
    "?": 699,
    ":": 700,
    "10000": 701,
    "isitright": 702,
    "j=1": 703,
    "s=0": 704,
    "a-1": 705,
    "v=0": 706,
    "b-1": 707,
    "n/2": 708,
    "l=0": 709,
    "k=1": 710,
    "k=2": 711,
    "1.exclusive": 712,
    "bool": 713,
    "col-1": 714,
    "j=m": 715,
    "20": 716,
    "but": 717,
    "last": 718,
    "equals": 719,
    "power": 720,
    "modi": 721,
    "res=1": 722,
    "res=": 723,
    "divide": 724,
    "a=": 725,
    "dirx=array": 726,
    "-1,0,0,1,1,1": 727,
    "diry=array": 728,
    "-1,0,1": 729,
    "-1,1": 730,
    "dx=array": 731,
    "-1,1,0,0": 732,
    "dy=array": 733,
    "0,0": 734,
    "y=int": 735,
    "cur=0": 736,
    "c=int": 737,
    "a=array": 738,
    "1005": 739,
    "r=string": 740,
    "c=0": 741,
    "decremented": 742,
    "column": 743,
    "s3": 744,
    "columns": 745,
    "assigning": 746,
    "TESTS": 747,
    "j=m-1": 748,
    "ma": 749,
    "iterate": 750,
    "lol": 751,
    "flag=1": 752,
    "rtr": 753,
    "4=0": 754,
    "num": 755,
    "o=true": 756,
    "o=false": 757,
    "j=int": 758,
    "part": 759,
    "c=1": 760,
    "flag=false": 761,
    "flag=true": 762,
    "mxn": 763,
    "sizeof": 764,
    "bytes": 765,
    "i/2": 766,
    "event": 767,
    "check=1": 768,
    "check=0": 769,
    "statement": 770,
    "mk": 771,
    "which": 772,
    "takes": 773,
    "evenly": 774,
    "divisible": 775,
    "1000005": 776,
    "intergers": 777,
    "YES": 778,
    "NO": 779,
    "l+1+i": 780,
    "YES\\n": 781,
    "NO\\n": 782,
    "SZ": 783,
    "1003": 784,
    "isprime": 785,
    "sieve": 786,
    "iprime": 787,
    "primes": 788,
    "isPrime": 789,
    "ji": 790,
    "prime": 791,
    "j+1": 792,
    "ifprime": 793,
    "squared": 794,
    "divides": 795,
    "without": 796,
    "remainder": 797,
    "good": 798,
    "3000": 799,
    "i+last+1": 800,
    "falst": 801,
    "sq": 802,
    "ceil": 803,
    "square": 804,
    "root": 805,
    "1005+0.0": 806,
    "prn": 807,
    "pr": 808,
    "next": 809,
    "primos": 810,
    "esPrimo": 811,
    "primo": 812,
    "n+1": 813,
    "1111": 814,
    "plen": 815,
    "incresing": 816,
    "last+i+1": 817,
    "i-1": 818,
    "bitset": 819,
    "was": 820,
    "100010": 821,
    "bits": 822,
    "bit": 823,
    "sqrt": 824,
    "fase": 825,
    "a^2": 826,
    "divided": 827,
    "defined": 828,
    "1010": 829,
    "visit": 830,
    "++": 831,
    "MAXN": 832,
    "pd": 833,
    "find_prime": 834,
    "find": 835,
    "mid": 836,
    "mz": 837,
    "pos": 838,
    "tmp": 839,
    "ju": 840,
    "insert": 841,
    "iterator": 842,
    "it": 843,
    "beginning": 844,
    "1,1": 845,
    "2002": 846,
    "puts": 847,
    "isp": 848,
    "Primes": 849,
    "20000": 850,
    "fin": 851,
    "30000": 852,
    "seive": 853,
    "exists": 854,
    "prevI": 855,
    "2000": 856,
    "memset": 857,
    "test": 858,
    "File": 859,
    "output.txt": 860,
    "input.txt": 861,
    "fast": 862,
    "pi": 863,
    "3.1415926": 864,
    "1e3": 865,
    "solve": 866,
    "address": 867,
    "is_prime": 868,
    "mark": 869,
    "nextPrime": 870,
    "noldbach": 871,
    "nextPrimeNum": 872,
    "error": 873,
    "arrar": 874,
    "pri": 875,
    "168": 876,
    "increments": 877,
    "1000+10": 878,
    "cin": 879,
    "4000": 880,
    "binary_search": 881,
    "1009": 882,
    "incremement": 883,
    "+prime": 884,
    "i-2": 885,
    "zero": 886,
    "sievesize": 887,
    "bs": 888,
    "600": 889,
    "putprime": 890,
    "isNoldPrime": 891,
    "returned": 892,
    "peimrs": 893,
    "=x": 894,
    "judge": 895,
    "ii": 896,
    "tp": 897,
    "cm": 898,
    "lt": 899,
    "has": 900,
    "assigned": 901,
    "flush": 902,
    "condition": 903,
    "met": 904,
    "so": 905,
    "pp": 906,
    "2222": 907,
    "pm": 908,
    "modulus": 909,
    "pm2": 910,
    "i+j+1": 911,
    "pv": 912,
    "oolean": 913,
    "lt+i+1": 914,
    "os": 915,
    "100001": 916,
    "1000010": 917,
    "phi": 918,
    "primesize": 919,
    "register": 920,
    "isdigit": 921,
    "getlist": 922,
    "listsize": 923,
    "pre": 924,
    "init": 925,
    "+=": 926,
    "get_prime": 927,
    "instance": 928,
    "w=": 929,
    "euql": 930,
    "86": 931,
    "steps": 932,
    "cnd": 933,
    "87": 934,
    "rounded": 935,
    "book": 936,
    "is_p": 937,
    "Seive": 938,
    "CalculatePrimes": 939,
    "limit": 940,
    "sums": 941,
    "primes.size": 942,
    "sums.push_back": 943,
    "sums.size": 944,
    "primes.begin": 945,
    "primes.end": 946,
    "inf": 947,
    "1e18": 948,
    "x=int": 949,
    "y=x/2": 950,
    "z=0": 951,
    "x-2": 952,
    "y=0": 953,
    "y=1": 954,
    "x/2": 955,
    "cont": 956,
    "star": 957,
    "display": 958,
    "tmp/2": 959,
    "dCount": 960,
    "starCount": 961,
    "decreasing": 962,
    "mf": 963,
    "tr": 964,
    "max_n": 965,
    "show": 966,
    "float": 967,
    "draw": 968,
    "202": 969,
    "201": 970,
    "2==0||n": 971,
    "Mid": 972,
    "DiamondCount": 973,
    "c=array": 974,
    "110": 975,
    "r=int": 976,
    "n/2+1": 977,
    "='D": 978,
    "=l": 979,
    "keep": 980,
    "going": 981,
    "doubles": 982,
    "301": 983,
    "numD": 984,
    "numStar": 985,
    "kkk": 986,
    "a.first": 987,
    "b.first": 988,
    "a.second": 989,
    "b.second": 990,
    "inc": 991,
    "iskom": 992,
    "k1": 993,
    "dem": 994,
    "MD": 995,
    "1000000009": 996,
    "2e3": 997,
    "33": 998,
    "n=int": 999,
    "s=array": 1000,
    "n/2-i": 1001,
    "j=n/2+1": 1002,
    "n-j-1": 1003,
    "i=n/2+1": 1004,
    "n-i-1": 1005,
    "sized": 1006,
    "matrix": 1007,
    "/2": 1008,
    "n/2-1": 1009,
    "write": 1010,
    "M": 1011,
    "K": 1012,
    "H": 1013,
    "W": 1014,
    "1000x1000": 1015,
    "forij": 1016,
    "key": 1017,
    "modpow": 1018,
    "u=modpow": 1019,
    "u=": 1020,
    "k=int": 1021,
    "tt=0": 1022,
    "e=0": 1023,
    "p=0": 1024,
    "n-k": 1025,
    "tt=1": 1026,
    "minus": 1027,
    "table": 1028,
    "half": 1029,
    "exlclusive": 1030,
    "102": 1031,
    "Size": 1032,
    "nothing": 1033,
    "i-n/2": 1034,
    "+abs": 1035,
    "j-n/2": 1036,
    "printDiamond": 1037,
    "diamond": 1038,
    "dotNum": 1039,
    "plus": 1040,
    "between": 1041,
    "m-i": 1042,
    "m+i": 1043,
    "abort": 1044,
    "program": 1045,
    "md": 1046,
    "endl": 1047,
    "sz": 1048,
    "s4": 1049,
    "s5": 1050,
    "s6": 1051,
    "ar2": 1052,
    "brainfuck": 1053,
    "=int": 1054,
    "n-i": 1055,
    "2-1": 1056,
    "2+1": 1057,
    "n-i2": 1058,
    "icrement": 1059,
    "stars": 1060,
    "ds": 1061,
    "mp": 1062,
    "n-": 1063,
    "x=0": 1064,
    "o=0": 1065,
    "i=n-2-1": 1066,
    "i+2": 1067,
    "n-i/2": 1068,
    "i=n-2": 1069,
    "n+i/2": 1070,
    "2.0": 1071,
    "accepts": 1072,
    "x-i": 1073,
    "x+i": 1074,
    "od": 1075,
    "boost": 1076,
    "Vector": 1077,
    "star_count": 1078,
    "d_count": 1079,
    "back": 1080,
    "looping": 1081,
    "nprint": 1082,
    "0x3f3f3f3f": 1083,
    "nd": 1084,
    "ns": 1085,
    "out": 1086,
    "t3": 1087,
    "j-1": 1088,
    "arr2": 1089,
    "colom": 1090,
    "toggle": 1091,
    "number": 1092,
    "input=array": 1093,
    "=input": 1094,
    "containing": 1095,
    "Assign": 1096,
    "2e5": 1097,
    "off_or_on": 1098,
    "bin": 1099,
    "two": 1100,
    "dimensional": 1101,
    "sizes": 1102,
    "light": 1103,
    "C": 1104,
    "n_i": 1105,
    "n_j": 1106,
    "dimensions": 1107,
    "pole": 1108,
    "naj": 1109,
    "iii": 1110,
    "ii+1": 1111,
    "ii-1": 1112,
    "isvalid": 1113,
    "curr": 1114,
    "actions": 1115,
    "AND": 1116,
    "NOT": 1117,
    "cpy": 1118,
    "lights": 1119,
    "off": 1120,
    "j1": 1121,
    "press": 1122,
    "ar1": 1123,
    "contents": 1124,
    "width": 1125,
    "11111": 1126,
    "jj": 1127,
    "remove": 1128,
    "imprimir": 1129,
    "encender": 1130,
    "aux": 1131,
    "TOOG": 1132,
    "_i": 1133,
    "ni": 1134,
    "nj=": 1135,
    "_j": 1136,
    "nj": 1137,
    "a=0": 1138,
    "a=1": 1139,
    "isval": 1140,
    "0\\n": 1141,
    "1\\n": 1142,
    "grid": 1143,
    "ar=array": 1144,
    "x=long": 1145,
    "=1-ar": 1146,
    "modd": 1147,
    "-1LL": 1148,
    "dir": 1149,
    "arr=array": 1150,
    "=fabs": 1151,
    "dimension": 1152,
    "+a": 1153,
    "5x5": 1154,
    "ara": 1155,
    "arx": 1156,
    "ary": 1157,
    "y=j": 1158,
    "checkodd": 1159,
    "b=array": 1160,
    "1-b": 1161,
    "bitwise-xor": 1162,
    "ou": 1163,
    "3x3": 1164,
    "incement": 1165,
    "T=string": 1166,
    "val": 1167,
    "a=long": 1168,
    "B=array": 1169,
    "C=char": 1170,
    "sum=A": 1171,
    "+A": 1172,
    "pdd": 1173,
    "ans=array": 1174,
    "sum=input": 1175,
    "matrices": 1176,
    "|": 1177,
    ".|D|": 1178,
    ".|.|": 1179,
    ".......................": 1180,
    "23": 1181,
    "O": 1182,
    "21": 1183,
    "outer": 1184,
    "inner": 1185,
    "...": 1186,
    "|D|": 1187,
    "|.|": 1188,
    "..": 1189,
    "|\\n": 1190,
    "|.|\\n": 1191,
    "copy": 1192,
    "zz": 1193,
    "kk": 1194,
    "numbers": 1195,
    "12": 1196,
    "single": 1197,
    "9999999999999": 1198,
    "db": 1199,
    "'|": 1200,
    "|O": 1201,
    "k2": 1202,
    "k3": 1203,
    "ost": 1204,
    "ind": 1205,
    "24": 1206,
    "followin": 1207,
    "bus": 1208,
    "1st": 1209,
    "2nd": 1210,
    "3rd": 1211,
    "4th": 1212,
    "5th": 1213,
    "6th": 1214,
    "27": 1215,
    "ith": 1216,
    "22": 1217,
    "+\\n": 1218,
    "|O.": 1219,
    "|O.O.": 1220,
    "|O.O.O.": 1221,
    "|O.O.O.O.": 1222,
    "13": 1223,
    "14": 1224,
    "|O.O.O.O.O.": 1225,
    "15": 1226,
    "16": 1227,
    "17": 1228,
    "|O.O.O.O.O.O.": 1229,
    "18": 1230,
    "19": 1231,
    "|O.O.O.O.O.O.O.": 1232,
    "|O.O.O.O.O.O.O.O.": 1233,
    "25": 1234,
    "26": 1235,
    "|O.O.O.O.O.O.O.O.O.": 1236,
    "28": 1237,
    "29": 1238,
    "|O.O.O.O.O.O.O.O.O.O.": 1239,
    "31": 1240,
    "32": 1241,
    "|O.O.O.O.O.O.O.O.O.O.O.|D|": 1242,
    "|O.O.O.O.O.O.O.O.O.O.O.|.|": 1243,
    "34": 1244,
    "Pi": 1245,
    "arc": 1246,
    "cosine": 1247,
    "-1.0": 1248,
    "11th": 1249,
    "proceed": 1250,
    "th": 1251,
    "infinite": 1252,
    "idx": 1253,
    "4x11": 1254,
    "second": 1255,
    "move": 1256,
    "passengers": 1257,
    "ttttttttttttttttttttttttttt": 1258,
    "'+": 1259,
    "fo": 1260,
    "ri": 1261,
    "'t": 1262,
    "che": 1263,
    "acos": 1264,
    "sandali": 1265,
    "0th": 1266,
    "jth": 1267,
    "+2": 1268,
    "......................": 1269,
    "a+4": 1270,
    "calc_subtractions_slow": 1271,
    "inlined": 1272,
    "numOps": 1273,
    "calc_subtractions_div": 1274,
    "calc_subtractions_mod": 1275,
    "calc_subtractions": 1276,
    "subtractions_solve": 1277,
    "numPairs": 1278,
    "cout": 1279,
    "b=int": 1280,
    "ans=0": 1281,
    "a/b": 1282,
    "a=a": 1283,
    "b/a": 1284,
    "b=b": 1285,
    "swap": 1286,
    "hasil": 1287,
    "ret": 1288,
    "tc": 1289,
    "cnt=0": 1290,
    "MAX=max": 1291,
    "MIN=min": 1292,
    "MAX": 1293,
    "MIN": 1294,
    "MAX/MIN": 1295,
    "temp=MIN": 1296,
    "MIN=MAX-MIN": 1297,
    "MAX=temp": 1298,
    "T": 1299,
    "unsigned": 1300,
    "swp": 1301,
    "addresses": 1302,
    "test_div": 1303,
    "1000000000": 1304,
    "999999999": 1305,
    "test_mod": 1306,
    "getNumbers": 1307,
    "gotValue": 1308,
    "gotVale": 1309,
    "subtractions_solve_low": 1310,
    "istream": 1311,
    "ostream": 1312,
    "subtractions_solve_fast": 1313,
    "getline": 1314,
    "nums": 1315,
    "round": 1316,
    "1.0": 1317,
    "x/y": 1318,
    "y/x": 1319,
    "=y": 1320,
    "Q": 1321,
    "cntint": 1322,
    "cntfloat": 1323,
    "adivb": 1324,
    "bdiva": 1325,
    "total": 1326,
    "positive": 1327,
    "doit": 1328,
    "1ll": 1329,
    "we": 1330,
    "valid": 1331,
    "orderArguments": 1332,
    "arg1": 1333,
    "arg2": 1334,
    "subtraction": 1335,
    "areg2": 1336,
    "arg1=": 1337,
    "arg2=": 1338,
    "quotient": 1339,
    "evaluate": 1340,
    "numOfTestCases": 1341,
    "casos": 1342,
    "modu": 1343,
    "cases": 1344,
    "num1": 1345,
    "num2": 1346,
    "ops": 1347,
    "gcd": 1348,
    "getans": 1349,
    "GCD": 1350,
    "decreased": 1351,
    "10000002": 1352,
    "1000001": 1353,
    "cift": 1354,
    "tek": 1355,
    "doIt": 1356,
    "t_ab": 1357,
    "t_a": 1358,
    "t_b": 1359,
    "calling": 1360,
    "bigger": 1361,
    "lower": 1362,
    "rad": 1363,
    "smaller": 1364,
    "larger": 1365,
    "mult": 1366,
    "infinitely": 1367,
    "a=b": 1368,
    "b=": 1369,
    "gcd_answ": 1370,
    "initialize": 1371,
    "settings": 1372,
    "1073741824": 1373,
    "MAX1": 1374,
    "3e8": 1375,
    "b=long": 1376,
    "x=max": 1377,
    "y=min": 1378,
    "m=max": 1379,
    "n=min": 1380,
    "x=m": 1381,
    "y=n": 1382,
    "B": 1383,
    "Calc": 1384,
    "0LL": 1385,
    "tc=int": 1386,
    "res=0": 1387,
    "h=b-a": 1388,
    "a-h": 1389,
    "h/a": 1390,
    "co": 1391,
    "shift": 1392,
    "places": 1393,
    "int64_t": 1394,
    "modex": 1395,
    "dv": 1396,
    "c=long": 1397,
    "r=0": 1398,
    "x=a": 1399,
    "b=x": 1400,
    "c=b/a": 1401,
    "b=b-a": 1402,
    "iterations": 1403,
    "noop": 1404,
    "final": 1405,
    "path": 1406,
    "txt.in": 1407,
    "txt.out": 1408,
    "fixed": 1409,
    "setprecision": 1410,
    "kq": 1411,
    "xuli": 1412,
    "_": 1413,
    "lcm": 1414,
    "retutn": 1415,
    "100005": 1416,
    "say": 1417,
    "cmd": 1418,
    "people_cnt": 1419,
    "maxs": 1420,
    "100+10": 1421,
    "unique": 1422,
    "skipping": 1423,
    "erase": 1424,
    "save": 1425,
    "position": 1426,
    "EOF": 1427,
    "1000000": 1428,
    "105": 1429,
    "byte": 1430,
    "active": 1431,
    "ineger": 1432,
    "commands": 1433,
    "person": 1434,
    "mark_idx": 1435,
    "send_size": 1436,
    "unintialized": 1437,
    "time": 1438,
    "neither": 1439,
    "colon": 1440,
    "followed": 1441,
    "1e2": 1442,
    "creatre": 1443,
    "mygets": 1444,
    "me": 1445,
    "characterfrom": 1446,
    "gets": 1447,
    "c3": 1448,
    "infinity": 1449,
    "comando": 1450,
    "ln": 1451,
    "n_participantes": 1452,
    "n_bytes": 1453,
    "n_participantes=0": 1454,
    "n_bytes=0": 1455,
    "linha_chat": 1456,
    "10005": 1457,
    "sm": 1458,
    "idx-1": 1459,
    "s.size": 1460,
    "local": 1461,
    "vis": 1462,
    "205": 1463,
    "vis.count": 1464,
    "strlen": 1465,
    "vis.size": 1466,
    "cine": 1467,
    "command": 1468,
    "id": 1469,
    "clear": 1470,
    "command.substr": 1471,
    "command.size": 1472,
    "lens": 1473,
    "frq": 1474,
    "count1": 1475,
    "store": 1476,
    "users": 1477,
    "traffic": 1478,
    "olnum": 1479,
    "charnum": 1480,
    "charsum": 1481,
    "indefinitely": 1482,
    "inpu": 1483,
    "coun": 1484,
    "count_now": 1485,
    "FindLen": 1486,
    "Set": 1487,
    "'s": 1488,
    "check1": 1489,
    "lengh": 1490,
    "txt": 1491,
    "ampty": 1492,
    "found": 1493,
    "answer": 1494,
    "100011": 1495,
    "decimal": 1496,
    "precision": 1497,
    "format": 1498,
    "cnt1": 1499,
    "cnt2": 1500,
    "tot": 1501,
    "incremen": 1502,
    "resp": 1503,
    "qClose": 1504,
    "1000000000000": 1505,
    "5001": 1506,
    "cur": 1507,
    "5050": 1508,
    "displayed": 1509,
    "utilize": 1510,
    "decimals": 1511,
    "fixed-point": 1512,
    "notation": 1513,
    "qmarks": 1514,
    "j=i": 1515,
    "1e7": 1516,
    "r-1": 1517,
    "5000": 1518,
    "fail": 1519,
    "-c": 1520,
    "j=u": 1521,
    "q+1": 1522,
    "c+q": 1523,
    "5010": 1524,
    "l=length": 1525,
    "l-1": 1526,
    "x+z": 1527,
    "y-z": 1528,
    "siz": 1529,
    "tmp2": 1530,
    "5e3": 1531,
    "dp": 1532,
    "sum1": 1533,
    "sum2": 1534,
    "sum3": 1535,
    "negative": 1536,
    "5005": 1537,
    "sup": 1538,
    "q=0": 1539,
    "3f3f3f3f": 1540,
    "exadecimal": 1541,
    "N=5050": 1542,
    "MAXN=5005": 1543,
    "vis=array": 1544,
    "s=string": 1545,
    "n=size": 1546,
    "j-i+1": 1547,
    "zuo": 1548,
    "wen": 1549,
    "que": 1550,
    "floating": 1551,
    "s=": 1552,
    "contstant": 1553,
    "recude": 1554,
    "god": 1555,
    "stirng": 1556,
    "kh": 1557,
    "zeroing": 1558,
    "them": 1559,
    "Terminate": 1560,
    "integral": 1561,
    "MAX_N": 1562,
    "1,000,000": 1563,
    "hex": 1564,
    "1e-10": 1565,
    "rt": 1566,
    "cout.precision": 1567,
    "ed": 1568,
    "f=0": 1569,
    "i=i+k": 1570,
    "f=1": 1571,
    "'T": 1572,
    "Z": 1573,
    "initial": 1574,
    "indexT": 1575,
    "indexG": 1576,
    "size_t": 1577,
    "inreasing": 1578,
    "crate": 1579,
    "start=0": 1580,
    "len=0": 1581,
    "c=": 1582,
    "start=1": 1583,
    "n=0": 1584,
    "s=i": 1585,
    "t=i": 1586,
    "i=s": 1587,
    "i+k": 1588,
    "i-k": 1589,
    "location": 1590,
    "BFS": 1591,
    "tar": 1592,
    "subtracting": 1593,
    "loc1": 1594,
    "loc2": 1595,
    "1120": 1596,
    "x=i": 1597,
    "y=i": 1598,
    "i=y": 1599,
    "+k": 1600,
    "a=i": 1601,
    "b=i": 1602,
    "i=a": 1603,
    "loct": 1604,
    "locg": 1605,
    "rue": 1606,
    "incrment": 1607,
    "r=1": 1608,
    "No": 1609,
    "dfs": 1610,
    "g=i": 1611,
    "i=g": 1612,
    "suucessful": 1613,
    "termination": 1614,
    "diff": 1615,
    "t-10": 1616,
    "diff=1": 1617,
    "-10": 1618,
    "G'or": 1619,
    "indG": 1620,
    "indT": 1621,
    "inputs": 1622,
    "insect": 1623,
    "=a": 1624,
    "Start": 1625,
    "End": 1626,
    "i=Start": 1627,
    "l=i": 1628,
    "m=i": 1629,
    "i=l": 1630,
    "i=i-k": 1631,
    "c=c+1": 1632,
    "hap": 1633,
    "m1=map": 1634,
    "lo": 1635,
    "itr=iterator": 1636,
    "k=long": 1637,
    "pos1": 1638,
    "pos2=long": 1639,
    "pos1=i": 1640,
    "pos2=i": 1641,
    "pos2": 1642,
    "100007": 1643,
    "_s": 1644,
    "_f": 1645,
    "k=min": 1646,
    "locg-loct": 1647,
    "post": 1648,
    "s8i": 1649,
    "st=-1": 1650,
    "ed=-1": 1651,
    "st=i": 1652,
    "ed=i": 1653,
    "i=st": 1654,
    "-k": 1655,
    "ti": 1656,
    "tg": 1657,
    "space": 1658,
    "str1": 1659,
    "str2": 1660,
    "str3": 1661,
    "days": 1662,
    "nonzero": 1663,
    "strcpy": 1664,
    "n1a": 1665,
    "n2a": 1666,
    "push_back": 1667,
    "sir1": 1668,
    "sir2": 1669,
    "p=string": 1670,
    "s1=p": 1671,
    "s2=p": 1672,
    "maxN": 1673,
    "1e6": 1674,
    "1e10": 1675,
    "s=a": 1676,
    "killed": 1677,
    "added": 1678,
    "day": 1679,
    "aa=a": 1680,
    "aa=b": 1681,
    "linf": 1682,
    "62": 1683,
    "iinf": 1684,
    "dinf": 1685,
    "1e17": 1686,
    "Mod": 1687,
    "100006": 1688,
    "c=a": 1689,
    "a=d": 1690,
    "b=string": 1691,
    "y=string": 1692,
    "a=y": 1693,
    "b=y": 1694,
    "=d": 1695,
    "readind": 1696,
    "rep": 1697,
    "kill": 1698,
    "na1": 1699,
    "na2": 1700,
    "n1=": 1701,
    "str4": 1702,
    "=integer": 1703,
    "compare": 1704,
    "copies": 1705,
    "pointed": 1706,
    "MAX2": 1707,
    "eps": 1708,
    "pot1": 1709,
    "pot2": 1710,
    "crete": 1711,
    "vict": 1712,
    "ele": 1713,
    "bal": 1714,
    "counts": 1715,
    "1e-8": 1716,
    "pod": 1717,
    "pod1": 1718,
    "res_arr": 1719,
    "to_be_replaced": 1720,
    "replaced_by": 1721,
    "name1": 1722,
    "name2": 1723,
    "temp1": 1724,
    "temp2": 1725,
    "1024": 1726,
    ".first": 1727,
    ".second": 1728,
    "=B": 1729,
    "=b": 1730,
    "=A": 1731,
    "af": 1732,
    "nex": 1733,
    "ft": 1734,
    "q.count": 1735,
    "s1.compare": 1736,
    "a=s": 1737,
    "s=b": 1738,
    "a0": 1739,
    "b0": 1740,
    "replacement": 1741,
    "a+y": 1742,
    "b+y": 1743,
    "death": 1744,
    "s3=s1": 1745,
    "setIO": 1746,
    "same": 1747,
    "b1": 1748,
    "vs": 1749,
    "Time": 1750,
    "elapsed": 1751,
    "clock": 1752,
    "CLOCKS_PER_SEC": 1753,
    "s.\\n": 1754,
    "digits": 1755,
    "ticks": 1756,
    "fir": 1757,
    "prevc": 1758,
    "prevr": 1759,
    "ls": 1760,
    "nx": 1761,
    "ff": 1762,
    "used": 1763,
    "iso": 1764,
    "chrColor": 1765,
    "color": 1766,
    "perColor": 1767,
    "perRowColor": 1768,
    "SIZE": 1769,
    "shorts": 1770,
    "anomalyFound": 1771,
    "matriz": 1772,
    "suma": 1773,
    "prom": 1774,
    "pass": 1775,
    "k+1": 1776,
    "tmp1": 1777,
    "tmp3": 1778,
    "isRow": 1779,
    "last_stripe": 1780,
    "current_stripe": 1781,
    "stripe": 1782,
    "str.find_first_not_of": 1783,
    ":npos": 1784,
    "fre": 1785,
    "2005": 1786,
    "m-2": 1787,
    "does": 1788,
    "n-2": 1789,
    "Print": 1790,
    "stderr": 1791,
    "prev": 1792,
    "func": 1793,
    "goto": 1794,
    "b=true": 1795,
    "upLetter": 1796,
    "letter": 1797,
    "downLetter": 1798,
    "palindrom": 1799,
    "begin": 1800,
    "numW": 1801,
    "numL": 1802,
    "word": 1803,
    "readn": 1804,
    "200007": 1805,
    "num/2": 1806,
    "j=n-1": 1807,
    "cmp": 1808,
    "ch2-": 1809,
    "chk": 1810,
    "untile": 1811,
    "-w": 1812,
    "1-": 1813,
    "998244353": 1814,
    "ONLINE__JUDGE": 1815,
    "ac": 1816,
    "lss": 1817,
    "act": 1818,
    "reverse": 1819,
    "s2.begin": 1820,
    "s2.end": 1821,
    "s1.size": 1822,
    "setf": 1823,
    "mi": 1824,
    "-1e9": 1825,
    "1002": 1826,
    "m/2": 1827,
    "inclsuive": 1828,
    "k=0": 1829,
    "m-i-1": 1830,
    "-s": 1831,
    "_=": 1832,
    "isP": 1833,
    "s.at": 1834,
    "v4": 1835,
    "can_change": 1836,
    "t=int": 1837,
    "n-1-i": 1838,
    "-2": 1839,
    "k=x-1": 1840,
    "lo++": 1841,
    "semicolumn": 1842,
    "T=int": 1843,
    "S=string": 1844,
    "ac=true": 1845,
    "t1=S": 1846,
    "-97": 1847,
    "t2=S": 1848,
    "t1-t2": 1849,
    "ac=false": 1850,
    "qpow": 1851,
    "again": 1852,
    "inve": 1853,
    "pri_num": 1854,
    "palin": 1855,
    "there": 1856,
    "g1": 1857,
    "YES|n": 1858,
    "palindrome": 1859,
    "modPow": 1860,
    "nCr": 1861,
    "Sieve": 1862,
    "1000009": 1863,
    "1000006": 1864,
    "factorial": 1865,
    "catalan": 1866,
    "isCheck": 1867,
    "a+1": 1868,
    "b+1": 1869,
    "str=string": 1870,
    "tam=int": 1871,
    "teste": 1872,
    "tam": 1873,
    "i=int": 1874,
    "lim=tam/2": 1875,
    "lim": 1876,
    "-str": 1877,
    "tam-i": 1878,
    "ncasos=int": 1879,
    "ncasos": 1880,
    "proverka": 1881,
    "othewise": 1882,
    "57": 1883,
    "check_palindrome": 1884,
    "b2": 1885,
    "alphabetic": 1886,
    "order": 1887,
    "previous": 1888,
    "before": 1889,
    "code": 1890,
    "lines": 1891,
    "candidate": 1892,
    "votes": 1893,
    "cond": 1894,
    "Max": 1895,
    "-9999999": 1896,
    "ending": 1897,
    "INFF": 1898,
    "1000000000000000005LL": 1899,
    "priority_queue": 1900,
    "liz": 1901,
    "top": 1902,
    "pop": 1903,
    "ncandidates": 1904,
    "nvotes": 1905,
    "changedVotes": 1906,
    "bestIndex": 1907,
    "bestVotes": 1908,
    "least": 1909,
    "leave": 1910,
    "b/gcd": 1911,
    "pq": 1912,
    "priority": 1913,
    "queue": 1914,
    "counts=0": 1915,
    "a+2": 1916,
    "a+n+1": 1917,
    "-10000": 1918,
    "forward": 1919,
    "front": 1920,
    "biggest": 1921,
    "pq.empty": 1922,
    "pq.top": 1923,
    "g=0": 1924,
    "highnum=0": 1925,
    "highid=-1": 1926,
    "highnum": 1927,
    "highid=y": 1928,
    "highid": 1929,
    "g=1": 1930,
    "log": 1931,
    "points": 1932,
    "allocate": 1933,
    "block": 1934,
    "memory": 1935,
    "smallest": 1936,
    "largest": 1937,
    "runs": 1938,
    "elemetns": 1939,
    "loops": 1940,
    "ascending": 1941,
    "forever": 1942,
    "107": 1943,
    "i=2": 1944,
    "p=a": 1945,
    "vote": 1946,
    "most": 1947,
    "max_element": 1948,
    "cnt++": 1949,
    "choc": 1950,
    "voters": 1951,
    "maxv": 1952,
    "loc": 1953,
    "having": 1954,
    "form": 1955,
    "l=": 1956,
    "arr+1": 1957,
    "arr+n": 1958,
    "font": 1959,
    "-ans": 1960,
    "comp": 1961,
    "fl": 1962,
    "my": 1963,
    "voters.top": 1964,
    "modn": 1965,
    "p.top": 1966,
    "dq": 1967,
    "greatest": 1968,
    "q=priority_queue": 1969,
    "temp=0": 1970,
    "t=first": 1971,
    "item": 1972,
    "f1": 1973,
    "TRIANGLE": 1974,
    "SEGMENT": 1975,
    "IMPOSSIBLE": 1976,
    "interchange": 1977,
    "xx+4": 1978,
    "b=0": 1979,
    "b++": 1980,
    "valuef": 1981,
    "IMPOSSIBLE\\n": 1982,
    "SEGMENT\\n": 1983,
    "TRIANGLE\\n": 1984,
    "terminate": 1985,
    "OR|": 1986,
    "'TRIANGLE": 1987,
    "arr=": 1988,
    "arr+4": 1989,
    "+v": 1990,
    "best": 1991,
    "best=integer": 1992,
    "v=": 1993,
    "par": 1994,
    "'IMPOSSIBLE": 1995,
    "checkDegenerate": 1996,
    "exchange": 1997,
    "seg": 1998,
    "normal": 1999,
    "deg": 2000,
    "b+c": 2001,
    "constants": 2002,
    "tri": 2003,
    "reopen": 2004,
    "debug.txt": 2005,
    "equ": 2006,
    "|=": 2007,
    "1,2,3,4": 2008,
    "continuing": 2009,
    "j'th": 2010,
    "i'th": 2011,
    "k'th": 2012,
    "triangle": 2013,
    "segment": 2014,
    "stat": 2015,
    "match": 2016,
    "base": 2017,
    "arrr2": 2018,
    "pad": 2019,
    "5e5": 2020,
    "mt": 2021,
    "pow": 2022,
    "s.length": 2023,
    "s.find": 2024,
    "s.substr": 2025,
    "fast_exp": 2026,
    "non": 2027,
    "theen": 2028,
    "base^2": 2029,
    "re": 2030,
    "longn": 2031,
    "mg": 2032,
    "conv": 2033,
    "ChuyenDoi": 2034,
    "000000000000000000": 2035,
    "flat": 2036,
    "=char": 2037,
    "524289": 2038,
    "tran": 2039,
    "biao": 2040,
    "op": 2041,
    "resulf": 2042,
    "alter": 2043,
    "x.size": 2044,
    "dig": 2045,
    "cnt.find": 2046,
    "cnt.end": 2047,
    "tipo": 2048,
    "usa": 2049,
    "us": 2050,
    "inter": 2051,
    "poss": 2052,
    "x=": 2053,
    "siz=": 2054,
    "-siz": 2055,
    "s2+s1": 2056,
    "ope": 2057,
    "bi": 2058,
    "query": 2059,
    "place": 2060,
    "num.size": 2061,
    "cast": 2062,
    "tobin": 2063,
    "constance": 2064,
    "var": 2065,
    "prepend": 2066,
    "maxm": 2067,
    "mp1": 2068,
    "mp2": 2069,
    "getsolved": 2070,
    "alpha": 2071,
    "mymap": 2072,
    "reads": 2073,
    "delete": 2074,
    "mymap=map": 2075,
    "sum=0": 2076,
    "ch=char": 2077,
    "base=0": 2078,
    "remains": 2079,
    "i=length": 2080,
    "k=s": 2081,
    "res.find_first_not_of": 2082,
    "res.substr": 2083,
    "pot": 2084,
    "s=+": 2085,
    "num=0": 2086,
    "+pot": 2087,
    "aux/10": 2088,
    "IntToPattern": 2089,
    "patt": 2090,
    "nl": 2091,
    "el": 2092,
    "sl": 2093,
    "Cnt": 2094,
    "msk": 2095,
    "x+k": 2096,
    "c=+": 2097,
    "c=-": 2098,
    "ch=+": 2099,
    "cn": 2100,
    "p=": 2101,
    "x/10": 2102,
    "a/__gcd": 2103,
    "dX": 2104,
    "dY": 2105,
    "map1": 2106,
    "lens-i": 2107,
    "newlien": 2108,
    "get_str": 2109,
    "n=num": 2110,
    "mp=map": 2111,
    "num=long": 2112,
    "sp=string": 2113,
    "sp": 2114,
    "str=get_str": 2115,
    "mcnt=0": 2116,
    "lead=0": 2117,
    "s=substring": 2118,
    "sp-cnt": 2119,
    "mcnt": 2120,
    "'S": 2121,
    "rr": 2122,
    "cc": 2123,
    "put": 2124,
    "row=array": 2125,
    "Create": 2126,
    "execute": 2127,
    "cakes=0": 2128,
    "==0": 2129,
    "cakes": 2130,
    "bools": 2131,
    "default": 2132,
    "cols": 2133,
    "respectively": 2134,
    "r=": 2135,
    "j=": 2136,
    "eaten": 2137,
    "Input": 2138,
    "Solve": 2139,
    "hor": 2140,
    "ver": 2141,
    "sets": 2142,
    "cake": 2143,
    "noteaten_r": 2144,
    "noteaten_c": 2145,
    "freq": 2146,
    "freq1": 2147,
    "zeroes": 2148,
    "i-cnt": 2149,
    "chn": 2150,
    "chm": 2151,
    "ans=integer": 2152,
    "s2.size": 2153,
    "ro": 2154,
    "'n": 2155,
    "rowsDeleted": 2156,
    "inputArr": 2157,
    "lenght": 2158,
    "rowCount": 2159,
    "colCount": 2160,
    "prunt": 2161,
    "rb": 2162,
    "cb": 2163,
    "lenghts": 2164,
    "cont2": 2165,
    "aux1": 2166,
    "aux2": 2167,
    "cont=0": 2168,
    "cont2=0": 2169,
    "aux1=0": 2170,
    "aux2=0": 2171,
    "@": 2172,
    "trans": 2173,
    "onf": 2174,
    "rowSet": 2175,
    "colSet": 2176,
    "eatable": 2177,
    "purple": 2178,
    "Power": 2179,
    "green": 2180,
    "blue": 2181,
    "Space": 2182,
    "orange": 2183,
    "Soul": 2184,
    "red": 2185,
    "Reality": 2186,
    "yellow": 2187,
    "Mind": 2188,
    "00": 2189,
    "names": 2190,
    "need": 2191,
    "null": 2192,
    "maxn=100010": 2193,
    "ignore": 2194,
    "comparison": 2195,
    "Power\\nTime\\nSpace\\nSoul\\nReality\\nMind\\n": 2196,
    "rfind": 2197,
    "x5": 2198,
    "x6": 2199,
    "output=array": 2200,
    "temp=string": 2201,
    "out=array": 2202,
    "=false": 2203,
    "t=0": 2204,
    "rean": 2205,
    "vvod": 2206,
    "reshala": 2207,
    "gol": 2208,
    "kachok": 2209,
    "y=": 2210,
    "nome": 2211,
    "0s": 2212,
    "mas": 2213,
    "mas1": 2214,
    "inclusve": 2215,
    "Names": 2216,
    "DeleteIt": 2217,
    "replace": 2218,
    "Colours": 2219,
    "s_color": 2220,
    "s_ip": 2221,
    "si": 2222,
    "k=array": 2223,
    "vet": 2224,
    "Power\\n": 2225,
    "Time\\n": 2226,
    "Space\\n": 2227,
    "Soul\\n": 2228,
    "Reality\\n": 2229,
    "Mind\\n": 2230,
    "puno": 2231,
    "nula": 2232,
    "nope": 2233,
    "GetStone": 2234,
    "FindNotFound": 2235,
    "stone": 2236,
    "stones": 2237,
    "ret=false": 2238,
    "ret=true": 2239,
    "stones=vector": 2240,
    "st=vector": 2241,
    "not_found=vector": 2242,
    "not_found": 2243,
    "gem": 2244,
    "have": 2245,
    "mass": 2246,
    "6-n": 2247,
    "ans1": 2248,
    "ans2": 2249,
    "ans3": 2250,
    "ans4": 2251,
    "ans5": 2252,
    "ans6": 2253,
    "sir": 2254,
    "colors": 2255,
    "strcmp": 2256,
    "gems": 2257,
    "iterating": 2258,
    "^": 2259,
    "-x": 2260,
    "exclusivev": 2261,
    "101-element": 2262,
    "signal": 2263,
    "postdecremented": 2264,
    "vis=false": 2265,
    "vis=true": 2266,
    "bt": 2267,
    "bohlam": 2268,
    "list": 2269,
    "duplicate": 2270,
    "consecutive": 2271,
    "150": 2272,
    "blag": 2273,
    "1,000-element": 2274,
    "Boolean": 2275,
    "cek": 2276,
    "INF_INT": 2277,
    "2147483647": 2278,
    "INF_LL": 2279,
    "9223372036854775807LL": 2280,
    "INF_ULL": 2281,
    "18446744073709551615Ull": 2282,
    "P": 2283,
    "92540646808111039LL": 2284,
    "Move": 2285,
    "Move_": 2286,
    "lasagna": 2287,
    "696969": 2288,
    "cyka": 2289,
    "blyat": 2290,
    "A=0": 2291,
    "p=set": 2292,
    "a=int": 2293,
    "l=int": 2294,
    "l=size": 2295,
    "buttons": 2296,
    "bulbs": 2297,
    "marks": 2298,
    "connected": 2299,
    "bulb_no": 2300,
    "is_possible": 2301,
    "ccreate": 2302,
    "inserting": 2303,
    "sizeofb": 2304,
    "105-elt": 2305,
    "bulb": 2306,
    "towhid": 2307,
    "towhid.size": 2308,
    "tail": 2309,
    "F": 2310,
    "removeDuplicates": 2311,
    "j++": 2312,
    "bul": 2313,
    "sizebul": 2314,
    "LIM": 2315,
    "nb": 2316,
    "nbulb": 2317,
    "qt": 2318,
    "20001": 2319,
    "An": 2320,
    "m-element": 2321,
    "turned": 2322,
    "contain": 2323,
    "10^9+7": 2324,
    "esclusive": 2325,
    "g=int": 2326,
    "g-1": 2327,
    "done=true": 2328,
    "asc": 2329,
    "t/": 2330,
    "dt": 2331,
    "nr": 2332,
    "Control": 2333,
    "jumps": 2334,
    "curlower": 2335,
    "NeedTime": 2336,
    "t=": 2337,
    "tim": 2338,
    "tim=tim+": 2339,
    "tim=": 2340,
    "seed": 2341,
    "131": 2342,
    "1200": 2343,
    "fi": 2344,
    "gotodown": 2345,
    "gotoup": 2346,
    "moves": 2347,
    "piso": 2348,
    "dist": 2349,
    "M-1": 2350,
    "ts": 2351,
    "xxx": 2352,
    "ud": 2353,
    "control": 2354,
    "ax": 2355,
    "l/2": 2356,
    "work": 2357,
    "0if": 2358,
    "ans=": 2359,
    "over": 2360,
    "timr": 2361,
    "max3": 2362,
    "adji": 2363,
    "adjo": 2364,
    "10000000000": 2365,
    "dif": 2366,
    "-=": 2367,
    "-f": 2368,
    "u_d": 2369,
    "d_u": 2370,
    "nap": 2371,
    "et": 2372,
    "t/m": 2373,
    "t/m+1": 2374,
    "tem": 2375,
    "temp=": 2376,
    "s-": 2377,
    "integerss": 2378,
    "tm": 2379,
    "ttt": 2380,
    "0x3FFFFFFF": 2381,
    "lca": 2382,
    "lcu": 2383,
    "peso": 2384,
    "contains": 2385,
    "LCA": 2386,
    "v/2": 2387,
    "u/2": 2388,
    "3e5": 2389,
    "log2": 2390,
    "cal": 2391,
    "parent": 2392,
    "route": 2393,
    "pu": 2394,
    "mxcommon": 2395,
    "rta": 2396,
    "cost": 2397,
    "131071": 2398,
    "sel": 2399,
    "depth": 2400,
    "dep_u": 2401,
    "dep_v": 2402,
    "A.find": 2403,
    "A.end": 2404,
    "decrementim": 2405,
    "temp0": 2406,
    "getPr": 2407,
    "getAns": 2408,
    "finish": 2409,
    "setTree": 2410,
    "send": 2411,
    "cost=map": 2412,
    "poskupi": 2413,
    "cena": 2414,
    "q=int": 2415,
    "w=long": 2416,
    "v=long": 2417,
    "q-1": 2418,
    "e=long": 2419,
    "lol=pair": 2420,
    "signature": 2421,
    "finder": 2422,
    "q=b": 2423,
    "x=lca": 2424,
    "log_=1": 2425,
    "y=log2": 2426,
    "x=log2": 2427,
    "2^log_": 2428,
    "log_": 2429,
    "i=log_": 2430,
    "y-2^": 2431,
    "substract": 2432,
    "2^": 2433,
    "p/2": 2434,
    "q/2": 2435,
    "e=a": 2436,
    "lol=e": 2437,
    "lol=a": 2438,
    "=z": 2439,
    "e=b": 2440,
    "lol=b": 2441,
    "dis": 2442,
    "anc": 2443,
    "qq": 2444,
    "inteiger": 2445,
    "tht": 2446,
    "p.find": 2447,
    "p.end": 2448,
    "dfs2": 2449,
    "tree": 2450,
    "add_path": 2451,
    "wh": 2452,
    "max1": 2453,
    "++freq": 2454,
    "pnt": 2455,
    "comparator": 2456,
    "brr": 2457,
    "500000": 2458,
    "it-": 2459,
    "main_str": 2460,
    "start_index": 2461,
    "str_for_compare": 2462,
    "reg": 2463,
    "occ": 2464,
    "ks": 2465,
    "-1000000007": 2466,
    "index1": 2467,
    "index2": 2468,
    "tmp_ans": 2469,
    "cent": 2470,
    "present": 2471,
    "a=string": 2472,
    "max=0": 2473,
    "j=i+1": 2474,
    "m=0": 2475,
    "i+m": 2476,
    "j+m": 2477,
    "max=m": 2478,
    "record": 2479,
    "intege": 2480,
    "str.size": 2481,
    "sub": 2482,
    "str.substr": 2483,
    "str.find": 2484,
    "sub.length": 2485,
    "all.size": 2486,
    "all=set": 2487,
    "i=size": 2488,
    "s-1": 2489,
    "s-i": 2490,
    "inserti": 2491,
    "s-i+1": 2492,
    "elseif": 2493,
    "v-1": 2494,
    "=k": 2495,
    "j=i-1": 2496,
    "fpr": 2497,
    "opposite": 2498,
    "forth": 2499,
    "deque": 2500,
    "deq": 2501,
    "countl": 2502,
    "countr": 2503,
    "V": 2504,
    "Bn": 2505,
    "preorder": 2506,
    "rearorder": 2507,
    "i=n": 2508,
    "bf": 2509,
    "l=false": 2510,
    "cou": 2511,
    "1e8": 2512,
    "ct": 2513,
    "marked": 2514,
    "seen=array": 2515,
    "K=int": 2516,
    "answer=0": 2517,
    "seen": 2518,
    "i=N-1": 2519,
    "head": 2520,
    "N=1000006": 2521,
    "inf=1000000007": 2522,
    "Arr=array": 2523,
    "n+2": 2524,
    "Arr": 2525,
    "lft=1": 2526,
    "lft": 2527,
    "rgt=n": 2528,
    "rgt": 2529,
    "manx": 2530,
    "remove_zeros": 2531,
    "ten": 2532,
    "bx": 2533,
    "cry": 2534,
    "a.size": 2535,
    "b.size": 2536,
    "ta": 2537,
    "tb": 2538,
    "ans.size": 2539,
    "era": 2540,
    "p.size": 2541,
    "srings": 2542,
    "a.begin": 2543,
    "a.end": 2544,
    "b.begin": 2545,
    "b.end": 2546,
    "a_": 2547,
    "b_": 2548,
    "c_": 2549,
    "remove_zero": 2550,
    "lzl": 2551,
    "x=1": 2552,
    "z++": 2553,
    "zeroRemover": 2554,
    "remove0": 2555,
    "gum": 2556,
    "10^k": 2557,
    "320": 2558,
    "n/10": 2559,
    "a+b": 2560,
    "A+B": 2561,
    "zx": 2562,
    "removeZeros": 2563,
    "tempa": 2564,
    "tempb": 2565,
    "rem1": 2566,
    "newa": 2567,
    "newb": 2568,
    "newsum": 2569,
    "putchar": 2570,
    "remv": 2571,
    "div": 2572,
    "static": 2573,
    "ostringstream": 2574,
    "getNum": 2575,
    "currMod": 2576,
    "zy": 2577,
    "removeZero": 2578,
    "takeing": 2579,
    "0.01": 2580,
    "three": 2581,
    "bit-wise": 2582,
    "returnr": 2583,
    "es": 2584,
    "ad": 2585,
    "cd": 2586,
    "bg": 2587,
    "cs": 2588,
    "multiplier": 2589,
    "bd": 2590,
    "darVuelta": 2591,
    "dig1": 2592,
    "quitarZeros": 2593,
    "sum1_str": 2594,
    "sum2_str": 2595,
    "string_int": 2596,
    "int_string": 2597,
    "ta+tb+cry": 2598,
    "p/10": 2599,
    "a1/10": 2600,
    "mul1": 2601,
    "mul2": 2602,
    "v/10": 2603,
    "/10": 2604,
    "y-1": 2605,
    "converted": 2606,
    "ss.str": 2607,
    "ss1": 2608,
    "anew": 2609,
    "ss2": 2610,
    "bnew": 2611,
    "ss3": 2612,
    "cnew": 2613,
    "matching": 2614,
    "removed": 2615,
    "stringstream": 2616,
    "geek": 2617,
    "geek1": 2618,
    "geek2": 2619,
    "gcd1": 2620,
    "modx": 2621,
    "1000000009LL": 2622,
    "ans2=": 2623,
    "adj": 2624,
    "pt": 2625,
    "en": 2626,
    "ne": 2627,
    "fa": 2628,
    "viy": 2629,
    "dg": 2630,
    "msh": 2631,
    "f2": 2632,
    "G1": 2633,
    "lsum": 2634,
    "ssum": 2635,
    "edges": 2636,
    "visited": 2637,
    "bo": 2638,
    "self": 2639,
    "gtw": 2640,
    "edge": 2641,
    "ada_edge": 2642,
    "ada_out_edge": 2643,
    "GRAPH": 2644,
    "DFS": 2645,
    "cost1": 2646,
    "cost1=cost": 2647,
    "cost2": 2648,
    ",1": 2649,
    "500005": 2650,
    "cycle": 2651,
    "sz-1": 2652,
    "gb1": 2653,
    "gb2": 2654,
    "integers=": 2655,
    "res1": 2656,
    "res2": 2657,
    "used.assign": 2658,
    "isVisited": 2659,
    "totAll": 2660,
    "totCc": 2661,
    "count2": 2662,
    "dfs1": 2663,
    "exlusive": 2664,
    "rom": 2665,
    "sh": 2666,
    "min1": 2667,
    "programming": 2668,
    "math": 2669,
    "PE": 2670,
    "team": 2671,
    "i3": 2672,
    "satu": 2673,
    "dua": 2674,
    "tiga": 2675,
    "groups": 2676,
    "its": 2677,
    "one.size": 2678,
    "two.size": 2679,
    "three.size": 2680,
    "npr": 2681,
    "nma": 2682,
